//Задача 1: Написать программу кроторая принимает на вход 3 числа и проверяет может ли существовать треугольник 
//со сторонами такой длинны 

//(Важно: Не может быть у треугольника такой стороны которая больше чем сумма двух других сторон) 
//(ВАЖНО: Условие существаания треугольника: одна сторона всегла сторого меньше сумме двух других )

//Задача 2: Преобразовать десятичное число в двоичную форму


//ДОМАШНИЕ ЗАДАЧИ


//Задача 1: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.



//Задача 2: Пользователь вводит с клавиатуры кол-во строк и столбцов для массива. Вывести массив в виде матрицы, 
//создав "рамку" из единиц, а внутреннюю зону матрицы заполнить нулями.
